org-contrib/gsoc2012/student-projects/git-merge-tool/index.org
# Created 2021-06-15 Tue 18:21
#+OPTIONS: H:3 num:nil toc:2 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE: Merge Tool for Org-Mode
#+AUTHOR: Andrew Young
#+startup: align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+seq_todo: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+tags: Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+language: en
#+html_link_up: https://orgmode.org/worg/org-faq.html
#+html_link_home: https://orgmode.org/worg/
#+exclude_tags: noexport

/A tool for for merging Org-Mode modifications/

* Git-Merge-Tool
** TODO Need to update link to repo
** About
Git-Merge-Tool is a specialised merge tool for [[https://orgmode.org/][Org-mode]] and [[http://git-scm.com/][Git]]. It
will be developed during the GSoC 2012.

There is currently no release for this project. Please stay tuned as
this project page will be updated when it becomes available.

** Summary
Org-Merge-Driver is to create an extension to Org-Mode which will act
as a merge driver for Org-Mode files. A merge driver is a program
which will combine two versions of a file based off of a common
ancestor into a single file, marking conflicting changes within. A
specialized merge driver for Org-Mode leverages the file structure to
understand the effects of modifications on the integrity of sections.

The main use of a merge driver is for use in collaborative writing.
Org-merge-driver will be compatible with Git, Mercurial, and
Bazaar. The merge driver will solidify Org-Mode as a tool for
collaborative work.

* Information

| Version             | 0.1                                              |
| License             | [[http://www.gnu.org/licenses/gpl.html][GPL V3]] |
| Author              | Andrew Young                                     |
| Supported Platforms | N/A                                              |
| Binaries            | N/A                                              |
| Contact             | youngar17 at gmail dot com                       |

** Documentation
- [[file:manual.org][Manual]]
- [[file:examples.org][Example Output]]

** More Information
- [[file:prototype.org][Prototype Information]]
- [[file:project-plan.org][Project Plan]]
- [[file:development.org][Current Development]]
- The original Google Summer of Code 2012 proposal can be found [[file:proposal.org][here]].
