org-contrib/gsoc2012/student-projects/git-merge-tool/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Merge Tool for Org-Mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrew Young" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://orgmode.org/worg/org-faq.html"> UP </a>
 |
 <a accesskey="H" href="https://orgmode.org/worg/"> HOME </a>
</div><div id="content">
<h1 class="title">Merge Tool for Org-Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb76a86">Git-Merge-Tool</a>
<ul>
<li><a href="#orge5d9114"><span class="todo TODO">TODO</span> Need to update link to repo</a></li>
<li><a href="#orgaf59171">About</a></li>
<li><a href="#org1cc7229">Summary</a></li>
</ul>
</li>
<li><a href="#org5c1484f">Information</a>
<ul>
<li><a href="#org96fb621">Documentation</a></li>
<li><a href="#org0265b3c">More Information</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>A tool for for merging Org-Mode modifications</i>
</p>

<div id="outline-container-orgbb76a86" class="outline-2">
<h2 id="orgbb76a86">Git-Merge-Tool</h2>
<div class="outline-text-2" id="text-orgbb76a86">
</div>
<div id="outline-container-orge5d9114" class="outline-3">
<h3 id="orge5d9114"><span class="todo TODO">TODO</span> Need to update link to repo</h3>
</div>
<div id="outline-container-orgaf59171" class="outline-3">
<h3 id="orgaf59171">About</h3>
<div class="outline-text-3" id="text-orgaf59171">
<p>
Git-Merge-Tool is a specialised merge tool for <a href="https://orgmode.org/">Org-mode</a> and <a href="http://git-scm.com/">Git</a>. It
will be developed during the GSoC 2012.
</p>

<p>
There is currently no release for this project. Please stay tuned as
this project page will be updated when it becomes available.
</p>
</div>
</div>

<div id="outline-container-org1cc7229" class="outline-3">
<h3 id="org1cc7229">Summary</h3>
<div class="outline-text-3" id="text-org1cc7229">
<p>
Org-Merge-Driver is to create an extension to Org-Mode which will act
as a merge driver for Org-Mode files. A merge driver is a program
which will combine two versions of a file based off of a common
ancestor into a single file, marking conflicting changes within. A
specialized merge driver for Org-Mode leverages the file structure to
understand the effects of modifications on the integrity of sections.
</p>

<p>
The main use of a merge driver is for use in collaborative writing.
Org-merge-driver will be compatible with Git, Mercurial, and
Bazaar. The merge driver will solidify Org-Mode as a tool for
collaborative work.
</p>
</div>
</div>
</div>

<div id="outline-container-org5c1484f" class="outline-2">
<h2 id="org5c1484f">Information</h2>
<div class="outline-text-2" id="text-org5c1484f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Version</td>
<td class="org-left">0.1</td>
</tr>

<tr>
<td class="org-left">License</td>
<td class="org-left"><a href="http://www.gnu.org/licenses/gpl.html">GPL V3</a></td>
</tr>

<tr>
<td class="org-left">Author</td>
<td class="org-left">Andrew Young</td>
</tr>

<tr>
<td class="org-left">Supported Platforms</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">Binaries</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">Contact</td>
<td class="org-left">youngar17 at gmail dot com</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org96fb621" class="outline-3">
<h3 id="org96fb621">Documentation</h3>
<div class="outline-text-3" id="text-org96fb621">
<ul class="org-ul">
<li><a href="manual.html">Manual</a></li>
<li><a href="examples.html">Example Output</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0265b3c" class="outline-3">
<h3 id="org0265b3c">More Information</h3>
<div class="outline-text-3" id="text-org0265b3c">
<ul class="org-ul">
<li><a href="prototype.html">Prototype Information</a></li>
<li><a href="project-plan.html">Project Plan</a></li>
<li><a href="development.html">Current Development</a></li>
<li>The original Google Summer of Code 2012 proposal can be found <a href="proposal.html">here</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Young</p>
<p class="date">Created: 2021-06-15 Tue 18:21</p>
</div>
</body>
</html>
